Model: "AEncoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)            (None, 1000)              785000    
_________________________________________________________________
dense_2 (Dense)            (None, 784)               784784    
_________________________________________________________________
dense_3 (Dense)            (None, 392)               307720    
_________________________________________________________________
dense_4 (Dense)            (None, 256)               100608    
_________________________________________________________________
dense_5 (Dense)            (None, 128)               32896     
_________________________________________________________________
out_enco_dense_6 (Dense)   (None, 64)                8256      
_________________________________________________________________
dense_7 (Dense)            (None, 32)                2080      
_________________________________________________________________
out_enco2_dense_8 (Dense)  (None, 24)                792       
_________________________________________________________________
dense_9 (Dense)            (None, 20)                500       
_________________________________________________________________
out_enco3_dense_10 (Dense)            (None, 16)                336       
_________________________________________________________________
dense_11 (Dense)            (None, 14)                238       
_________________________________________________________________
out_enco4_dense_12 (Dense)  (None, 12)                180       
_________________________________________________________________
dense_13 (Dense)            (None, 11)                143       
_________________________________________________________________
out_enco5_dense_14 (Dense)  (None, 10)                120       
_________________________________________________________________
dense_15 (Dense)            (None, 9)                 99        
_________________________________________________________________
out_enco6_dense_16 (Dense)  (None, 8)                 80        
_________________________________________________________________
dense_17 (Dense)            (None, 7)                 63        
_________________________________________________________________
out_enco7_dense_18 (Dense)  (None, 6)                 48        
_________________________________________________________________
dense_19 (Dense)            (None, 6)                 42        
_________________________________________________________________
out_enco8_dense_20 (Dense)  (None, 5)                 35        
_________________________________________________________________
dense_21 (Dense)            (None, 5)                 30        
_________________________________________________________________
dense_22 (Dense)            (None, 4)                 24        
_________________________________________________________________
dense_23 (Dense)            (None, 4)                 20        
_________________________________________________________________
out_enco10_dense_24 (Dense) (None, 3)                 15        
_________________________________________________________________
dense_25 (Dense)            (None, 3)                 12        
_________________________________________________________________
out_enco11_dense_26 (Dense) (None, 2)                 8         
_________________________________________________________________
dense_27 (Dense)            (None, 2)                 6         
_________________________________________________________________
out_deco11_dense_28 (Dense) (None, 3)                 9         
_________________________________________________________________
dense_29 (Dense)            (None, 3)                 12        
_________________________________________________________________
out_deco10_dense_30 (Dense) (None, 4)                 16        
_________________________________________________________________
dense_31 (Dense)            (None, 4)                 20        
_________________________________________________________________
out_deco9_dense_32 (Dense)  (None, 5)                 25        
_________________________________________________________________
dense_33 (Dense)            (None, 5)                 30        
_________________________________________________________________
out_deco8_dense_34 (Dense)  (None, 6)                 36        
_________________________________________________________________
dense_35 (Dense)            (None, 6)                 42        
_________________________________________________________________
dense_36 (Dense)            (None, 7)                 49        
_________________________________________________________________
out_deco37 (Dense)            (None, 8)                 64        
_________________________________________________________________
dense_38 (Dense)            (None, 8)                 72        
_________________________________________________________________
dense_39 (Dense)            (None, 9)                 81        
_________________________________________________________________
out_deco6_dense_40 (Dense)  (None, 10)                100       
_________________________________________________________________
dense_41 (Dense)            (None, 10)                110       
_________________________________________________________________
dense_42 (Dense)            (None, 11)                121       
_________________________________________________________________
out_deco5_dense_43 (Dense)  (None, 12)                144       
_________________________________________________________________
dense_44 (Dense)            (None, 12)                156       
_________________________________________________________________
dense_45 (Dense)            (None, 14)                182       
_________________________________________________________________
out_deco4_dense_46 (Dense)  (None, 16)                240       
_________________________________________________________________
dense_47 (Dense)            (None, 16)                272       
_________________________________________________________________
dense_48 (Dense)            (None, 20)                340       
_________________________________________________________________
out_deco3_dense_49 (Dense)   (None, 24)                504       
_________________________________________________________________
dense_50 (Dense)            (None, 24)                600       
_________________________________________________________________
dense_51 (Dense)            (None, 32)                800       
_________________________________________________________________
out_deco2_dense_52 (Dense)  (None, 64)                2112      
_________________________________________________________________
dense_53 (Dense)            (None, 128)               8320      
_________________________________________________________________
dense_54 (Dense)            (None, 256)               33024     
_________________________________________________________________
dense_55 (Dense)            (None, 392)               100744    
_________________________________________________________________
dense_56 (Dense)            (None, 784)               308112    
_________________________________________________________________
dense_57 (Dense)            (None, 1000)              785000    
_________________________________________________________________
dense_58 (Dense)            (None, 784)               784784    
=================================================================
Total params: 4,050,256
Trainable params: 4,050,256
Non-trainable params: 0